/* eslint-disable quote-props */
/* eslint-disable key-spacing */
export const getGradientFromArray = (colors) => {
  const gradient = colors.reduce((acc, curr, i, arr) => {
    const percentDelta = ~~(100 / arr.length);
    return `${acc}, ${curr} ${i * percentDelta}%, ${curr} ${(i + 1) * percentDelta}%`;
  }, ``);
  return `linear-gradient(135deg ${gradient})`;
};


export const ColorNameToHexMap = {
  // 'Бежевый':        [`#f5f5dc`, `#f5f5dc`],
  'бежевый':        [`#fcfccf`, `#f5f5dc`],
  'бело-черные':    [`#ffffff`, `#000000`],
  'белый':          [`#ffffff`, `#ffffff`],
  'бирюзовый':      [`#30d5c8`, `#30d5c8`],
  'бордовый':       [`#9b2d30`, `#9b2d30`],
  'голубой':        [`#42aaff`, `#42aaff`],
  'желто-зеленый':  [`#ffff00`, `#00ff00`],
  'желтый':         [`#ffff00`, `#ffff00`],
  'зеленый':        [`#00ff00`, `#00ff00`],
  'золотой':        [`#ffd700`, `#ffd700`],
  'камуфляж':       [`#78866b`, `#425e17`],
  'коралловый':     [`#ff7f50`, `#ff7f50`],
  'коричневый':     [`#964b00`, `#964b00`],
  'красный':        [`#ff0000`, `#ff0000`],
  'мятный':         [`#3eb489`, `#3eb489`],
  'оранжевый':      [`#ffa500`, `#ffa500`],
  'песочный':       [`#fcdd76`, `#fcdd76`],
  'разноцветный':   [`#ff0000`, `#ffa500`, `#ffff00`, `#008000`, `#42aaff`, `#0000ff`, `#8b00ff`],
  'розовый':        [`#ffc0cb`, `#ffc0cb`],
  'серебристый':    [`#d7d7d8`, `#c7c9cb`],
  'серый':          [`#aeb2b8`, `#aeb2b8`],
  'синий':          [`#0000ff`, `#0000ff`],
  'фиолетовый':     [`#8b00ff`, `#8b00ff`],
  'черно-розовый':  [`#000000`, `#ffc0cb`],
  'черный':         [`#000000`, `#000000`],
  'чёрный/белый':   [`#ffffff`, `#000000`],
  'чёрный/красный': [`#ff0000`, `#000000`],
  'черный/синий':   [`#0000ff`, `#000000`],
  'черный/серый':   [`#000000`, `#cccccc`],
  'черный/желтый':  [`#ffff00`, `#000000`],
  'черный/зеленый': [`#00ff00`, `#000000`],
  'черный/голубой': [`#42aaff`, `#000000`],
  'вишня':          [`#de3163`, `#de3163`],
  'хаки':           [`#78866b`, `#78866b`],
};
